In [1]:
import numpy as np
import pandas as pd

## Series

In [2]:
myDict = {"A":50,"B":40,"C":30}

In [3]:
pd.Series(myDict)

A    50
B    40
C    30
dtype: int64

In [5]:
ages = [50,40,30]
names = ["A","B","C"]

In [7]:
pd.Series(ages,names)

A    50
B    40
C    30
dtype: int64

## DataFrames

In [8]:
data = np.random.randn(4,3)

In [14]:
dataFrame = pd.DataFrame(data)

In [15]:
dataFrame

          0         1         2
0 -0.489756  0.061429 -0.008716
1  0.240413  1.015012  0.189730
2 -1.010911  0.953375  0.820910
3  1.179207  0.824438  1.738910

In [12]:
newDataFrame = pd.DataFrame(data, index=["A","B","C","D"], columns=["X","Y","Z"])

In [13]:
newDataFrame

          X         Y         Z
A -0.489756  0.061429 -0.008716
B  0.240413  1.015012  0.189730
C -1.010911  0.953375  0.820910
D  1.179207  0.824438  1.738910

In [16]:
newDataFrame[["X","Y"]]

          X         Y
A -0.489756  0.061429
B  0.240413  1.015012
C -1.010911  0.953375
D  1.179207  0.824438

In [17]:
newDataFrame.loc["C"]

X   -1.010911
Y    0.953375
Z    0.820910
Name: C, dtype: float64

In [19]:
newDataFrame.iloc[1]

X    0.240413
Y    1.015012
Z    0.189730
Name: B, dtype: float64

In [20]:
newDataFrame["Q"] = newDataFrame["X"] * 2

In [21]:
newDataFrame

          X         Y         Z         Q
A -0.489756  0.061429 -0.008716 -0.979512
B  0.240413  1.015012  0.189730  0.480827
C -1.010911  0.953375  0.820910 -2.021822
D  1.179207  0.824438  1.738910  2.358414

In [22]:
newDataFrame.drop("Q", axis=1)

          X         Y         Z
A -0.489756  0.061429 -0.008716
B  0.240413  1.015012  0.189730
C -1.010911  0.953375  0.820910
D  1.179207  0.824438  1.738910

In [23]:
newDataFrame

          X         Y         Z         Q
A -0.489756  0.061429 -0.008716 -0.979512
B  0.240413  1.015012  0.189730  0.480827
C -1.010911  0.953375  0.820910 -2.021822
D  1.179207  0.824438  1.738910  2.358414

In [25]:
newDataFrame.drop("Q", axis=1, inplace=True)

In [26]:
newDataFrame

          X         Y         Z
A -0.489756  0.061429 -0.008716
B  0.240413  1.015012  0.189730
C -1.010911  0.953375  0.820910
D  1.179207  0.824438  1.738910

In [27]:
newDataFrame[newDataFrame>0]

          X         Y        Z
A       NaN  0.061429      NaN
B  0.240413  1.015012  0.18973
C       NaN  0.953375  0.82091
D  1.179207  0.824438  1.73891

In [28]:
newDataFrame[newDataFrame["X"]>0]

          X         Y        Z
B  0.240413  1.015012  0.18973
D  1.179207  0.824438  1.73891

In [29]:
firstIndexes = ["Simpson","Simpson","Simpson","South Park","South Park","South Park"]

In [30]:
secondIndexes =["Homer","Bart","Marge","Cartman","Kenny","Kyle"]

In [31]:
mergedIndexes = list(zip(firstIndexes,secondIndexes))

In [32]:
mergedIndexes = pd.MultiIndex.from_tuples(mergedIndexes)

In [33]:
mergedIndexes

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [34]:
myCartoonList = [[40,"A"],[10,"B"],[30,"C"],[9,"D"],[10,"E"],[11,"F"]]

In [35]:
cartoonNumpyList = np.array(myCartoonList)

In [36]:
cartoonDataFrame = pd.DataFrame(cartoonNumpyList, index=mergedIndexes, columns=["Age","Occupation"])

In [37]:
cartoonDataFrame

                   Age Occupation
Simpson    Homer    40          A
           Bart     10          B
           Marge    30          C
South Park Cartman   9          D
           Kenny    10          E
           Kyle     11          F

In [38]:
cartoonDataFrame.loc["South Park"]

        Age Occupation
Cartman   9          D
Kenny    10          E
Kyle     11          F

In [40]:
cartoonDataFrame.loc["South Park"].loc["Cartman"]

Age           9
Occupation    D
Name: Cartman, dtype: object

In [41]:
cartoonDataFrame.index.names = ["Cartoon Name","Character Name"]

In [42]:
cartoonDataFrame

                            Age Occupation
Cartoon Name Character Name
Simpson      Homer           40          A
             Bart            10          B
             Marge           30          C
South Park   Cartman          9          D
             Kenny           10          E
             Kyle            11          F